app/workers/records_worker.rb

  def perform(csv_upload_id)
    csv_upload = CsvUpload.find(csv_upload_id)
    raise StandardError, "Could not find csv upload for id: #{csv_upload_id}" unless csv_upload


    CSV.foreach(csv_upload.csv.file.path, headers: true).with_index(1) do |row, line_number|
      logger.info row.to_s
      new_record = Record.new(row.to_h.merge(csv_upload_id: csv_upload_id))
      unless new_record.save
        new_record.errors.full_messages.each do |error_message|
          ImportError.create(csv_upload_id:csv_upload_id, row_number: line_number, error_message: error_message)
---
SELECT  "csv_uploads".* FROM "csv_uploads" WHERE "csv_uploads"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "records" ("last", "phone", "email", "csv_upload_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["last", "Cesnik"], ["phone", "7654321718"], ["email", "greg.cesnik@gmail.com"], ["csv_upload_id", 1], ["created_at", "2019-09-16 03:27:34.213470"], ["updated_at", "2019-09-16 03:27:34.213470"]]
SELECT "records".* FROM "records" WHERE "records"."csv_upload_id" = $1  [["csv_upload_id", 5]]
INSERT INTO "import_errors" ("row_number", "error_message", "csv_upload_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["row_number", 1], ["error_message", "First can only be letters"], ["csv_upload_id", 3], ["created_at", "2019-09-16 03:19:08.293416"], ["updated_at", "2019-09-16 03:19:08.293416"]]