app/views/csv_uploads/index.html.erb

    <tbody>
      <% csv_upload.records.each do |record| %>
---
SELECT "records".* FROM "records" WHERE "records"."csv_upload_id" = $1  [["csv_upload_id", 1]]

  </table>
  <% unless csv_upload.import_errors.blank? %>
---
SELECT "import_errors".* FROM "import_errors" WHERE "import_errors"."csv_upload_id" = $1  [["csv_upload_id", 17]]

      <tbody>
        <% csv_upload.import_errors.each do |import_error| %>
---
SELECT "import_errors".* FROM "import_errors" WHERE "import_errors"."csv_upload_id" = $1  [["csv_upload_id", 17]]