app/controllers/csv_uploads_controller.rb

  def index
    @csv_uploads = CsvUpload.all.order(created_at: :desc)
---
SELECT "csv_uploads".* FROM "csv_uploads" ORDER BY "csv_uploads"."created_at" DESC

  def create
    @csv_upload = CsvUpload.new(csv_upload_params)
    if @csv_upload.save
---
INSERT INTO "csv_uploads" ("identifier", "csv", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["identifier", "Test"], ["csv", "bevchic2.png"], ["created_at", "2019-09-16 01:05:28.022406"], ["updated_at", "2019-09-16 01:05:28.022406"]]

  def delete_all
    CsvUpload.destroy_all
---
DELETE FROM "csv_uploads" WHERE "csv_uploads"."id" = $1  [["id", 10]]